name: "llm"
backend: "python"
max_batch_size: 32

input [
  { name: "input_ids", data_type: TYPE_INT32, dims: [-1] },
  { name: "max_new_tokens", data_type: TYPE_INT32, dims: [1] }
]

output [
  { name: "output_ids", data_type: TYPE_INT32, dims: [-1] }
]

instance_group [
  { kind: KIND_GPU, count: 1 }
]
